let href = 'javascript:void(0)';

new Vue({
  el: '#site-nav',
  data: {
    siteNav: [
      ['天猫超市', '喵鲜生', '科技新品', '女装新品', '酷玩街', '内衣新品', '试美妆', '运动新品', '时尚先生', '精明妈咪', '吃乐会', '企业采购', '会员积分', '天猫国际', '品质频道'],
      ['美妆','电器','女装','男装','女鞋','男鞋','内衣','箱包','运动','母婴','家装','医药','食品','配饰','汽车'],
      ['帮助中心','品质保障','特色服务','7天退换货']
    ],
    href: href
  }
})

new Vue({
  el: '#header',
  data: {
    searchSuggestion: ['针织衫','连衣裙','四件套','摄像头','客厅灯','口红','手机','运动鞋','牛奶'],
    headNav: ['天猫会员','电器城','喵鲜生','医药馆','营业厅','魅力惠','飞猪旅行','苏宁易购'],
    href: href
  }
})

new Vue({
  el: '#content-wrap',
  data: {
    catelist: [
      ['女装新品','商场同款','仙女连衣裙','T恤','衬衫','时髦外套','休闲裤','牛仔裤','无痕文胸','运动文胸','潮流家居服','百搭船袜'],
      ['毛呢外套','羽绒服','棉服','丝绒卫衣','毛针织衫','皮毛一体','皮草毛衣','衬衫','卫衣','针织衫','T恤','短外套','小西装','风衣'],
      ['连衣裙','半身裙','A字裙','荷叶边裙','大摆裙','包臀裙','百褶裙','长袖连衣裙','棉麻连衣裙','牛仔裙','蕾丝连衣裙','真丝连衣裙','印花连衣裙'],
      ['休闲裤','阔腿裤','牛仔裤','打底裤','开叉运动裤','哈伦裤','背带裤','小脚裤','西装裤','短裤'],
      ['时尚套装','休闲套装','日系女装','精选妈妈装','大码女装','职业套装','优雅旗袍','精致礼服','婚纱','唐装','小码女装'],
      ['光面文胸','运动文胸','美背文胸','聚拢文胸','大杯文胸','轻薄塑身'],
      ['春夏家居服','纯棉家居服','莫代尔家居服','真丝家居服','春夏睡裙','男士家居服','情侣家居服','性感睡裙'],
      ['男士内裤','女式内裤','男士内裤多条装','女士内裤多条装','莫代尔内裤','吊带背心'],
      ['当季新品','商场同款','印花T恤','潮流卫衣','牛仔衬衫','修身夹克','保暖棉服','棉麻面料','温暖的针织衫','修身西服','秋冬风衣','束脚裤','九分裤','破洞牛仔裤','跑步鞋','休闲鞋','篮球鞋','自行车','平衡车','帆布鞋','运动套装','运动卫衣','鱼竿','冲锋衣','跑步机','电动车'],
      ['夹克','单西','棒球服','棉衣','毛呢大衣','风衣','西服套装','羽绒服','皮衣','运动服','工装外套','针织','开衫马甲'],
      ['短袖T恤','POLO衫','短袖衬衫','背心','卫衣','针织衫/毛衣','长袖衬衫','长袖T恤'],
      ['小脚裤','9分裤','短裤','休闲裤','牛仔裤','针织裤','西裤','运动裤','工装裤'],
      ['潮牌','中老年加大码','职场精英','中国风','情侣装'],
      ['跑步鞋','运动鞋','板鞋','潮鞋','休闲鞋','篮球鞋','足球鞋'],
      ['短袖t恤','运动裤','运动内衣','速干t恤','运动Polo','运动卫衣','运动套装','运动短裤','健身服','运动茄克'],
      ['冲锋衣','抓绒衣','登山鞋','户外休闲衣','军迷','钓鱼服'],
      ['潮流过膝靴','气质百搭踝靴','永远的帆布鞋','流行松糕底','英伦牛津鞋'],
      ['商场同款','休闲鞋','正装皮鞋','休闲皮鞋','板鞋','户外休闲帆布鞋','运动休闲乐福鞋','豆豆鞋','布洛克帆船鞋','布鞋'],
      ['单鞋','小白鞋','商场同款','帆布鞋','深口单鞋','浅口单鞋','平底单鞋','高跟单鞋','坡跟单鞋','豆豆鞋','乐福鞋','牛津鞋'],
      ['妈妈鞋','大码女鞋','小码女鞋','女内增高','男内增高','软轻风爸爸鞋','大码男鞋','小码男鞋'],
      ['新品推荐','商场同款','女士钱包','单肩包','斜跨包','手提包','手拿包','腰包','胸包','化妆包'],
      ['男士钱包','收纳包','胸包','腰包','手拿包','手提包','斜跨包','单肩包','商场同款','新品推荐'],
      ['旅行箱','万向轮箱','旅行袋','女士双肩包','男士双肩包','韩版双肩包','铆钉双肩包','女士钱包','男士钱包','大容量','印花'],
    ],
    href: href
  }
})